Tekla.Structures.Model.Internal.BimModelDataProduct.Types.UploadProgress
Represents the progress for a file upload operation.

Tekla.Structures.Model.Internal.BimModelDataProduct.Types.UploadProgress.TotalBytes
Gets the total number of bytes to upload, 0 if total is unknown.

Tekla.Structures.Model.Internal.BimModelDataProduct.Types.UploadProgress.UploadedBytes
Gets the number of bytes uploaded so far.

Tekla.Structures.Model.Internal.BimModelDataProduct.Types.UploadProgress.PercentComplete
Gets the upload progress as a percentage (0-100). If total is unknown, returns null.
If null, it indicates we can't determine the completed percentage as we don't know the total size.
UI should handle this case appropriately (e.g don't show percentage of completion but bytes upload).

Tekla.Structures.Model.Internal.BimModelDataProduct.Types.UploadProgress.#ctor(System.Nullable{System.Int64},System.Int64)
Initializes a new instance of the Tekla.Structures.Model.Internal.BimModelDataProduct.Types.UploadProgress class with known total size.
totalBytes: The total number of bytes to upload.
bytesUploaded: The number of bytes uploaded so far.